[Killed] BlockStatement
src/events/publishers/locationPublisher.ts:29:19
   appointmentId: string;
   doctorId: string;
   patientId: string;
-}): Promise<void> {
-  const event: DoctorOnTheWayEvent = {
-    ...createBaseEvent(),
-    eventType: 'DoctorOnTheWay',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    startedAt: new Date().toISOString(),
-  };
-
-  logger.info('[LocationPublisher] Publishing DoctorOnTheWay event', {
-    eventType: 'DoctorOnTheWay',
-    eventId: event.eventId,
-    appointmentId: event.appointmentId,
-    userId: event.patientId,
-  });
-
-  await publishEvent(KAFKA_TOPICS.DOCTOR_ON_THE_WAY, event);
-}
+}): Promise<void> {}
 
 export async function publishDoctorArrived(params: {
killedBy: Location Kafka Publishers Unit Suite publishDoctorOnTheWay should construct DoctorOnTheWay event and call publishEvent with DOCTOR_ON_THE_WAY topic
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/events/publishers/locationPublisher.ts:32:16
 }): Promise<void> {
   const event: DoctorOnTheWayEvent = {
     ...createBaseEvent(),
-    eventType: 'DoctorOnTheWay',
+    eventType: "",
     appointmentId: params.appointmentId,
     doctorId: params.doctorId,
killedBy: Location Kafka Publishers Unit Suite publishDoctorOnTheWay should construct DoctorOnTheWay event and call publishEvent with DOCTOR_ON_THE_WAY topic
statusReason: expected "vi.fn()" to be called with arguments: [ 'docdock.doctor.on_the_way', …(1) ]

Received:

  1st vi.fn() call:

  [
    "docdock.doctor.on_the_way",

[Killed] BlockStatement
src/events/publishers/locationPublisher.ts:53:19
   appointmentId: string;
   doctorId: string;
   patientId: string;
-}): Promise<void> {
-  const event: DoctorArrivedEvent = {
-    ...createBaseEvent(),
-    eventType: 'DoctorArrived',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    arrivedAt: new Date().toISOString(),
-  };
-
-  logger.info('[LocationPublisher] Publishing DoctorArrived event', {
-    eventType: 'DoctorArrived',
-    eventId: event.eventId,
-    appointmentId: event.appointmentId,
-    userId: event.patientId,
-  });
-
-  await publishEvent(KAFKA_TOPICS.DOCTOR_ARRIVED, event);
-}
+}): Promise<void> {}
 
 export async function publishTripCancelled(params: {
killedBy: Location Kafka Publishers Unit Suite publishDoctorArrived should construct DoctorArrived event and call publishEvent with DOCTOR_ARRIVED topic
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/events/publishers/locationPublisher.ts:54:37
   doctorId: string;
   patientId: string;
 }): Promise<void> {
-  const event: DoctorArrivedEvent = {
-    ...createBaseEvent(),
-    eventType: 'DoctorArrived',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    arrivedAt: new Date().toISOString(),
-  };
+  const event: DoctorArrivedEvent = {};
 
   logger.info('[LocationPublisher] Publishing DoctorArrived event', {
killedBy: Location Kafka Publishers Unit Suite publishDoctorArrived should construct DoctorArrived event and call publishEvent with DOCTOR_ARRIVED topic
statusReason: expected "vi.fn()" to be called with arguments: [ 'docdock.doctor.arrived', …(1) ]

Received:

  1st vi.fn() call:

  [
    "docdock.doctor.arrived",

[Killed] BlockStatement
src/events/publishers/locationPublisher.ts:79:19
   patientId: string;
   cancelledBy: 'doctor' | 'patient' | 'system';
   reason?: string;
-}): Promise<void> {
-  const event: TripCancelledEvent = {
-    ...createBaseEvent(),
-    eventType: 'TripCancelled',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    cancelledBy: params.cancelledBy,
-    reason: params.reason,
-  };
-
-  logger.info('[LocationPublisher] Publishing TripCancelled event', {
-    eventType: 'TripCancelled',
-    eventId: event.eventId,
-    appointmentId: event.appointmentId,
-    userId: event.patientId,
-  });
-
-  await publishEvent(KAFKA_TOPICS.TRIP_CANCELLED, event);
-}
+}): Promise<void> {}
 
 export async function publishTripCompleted(params: {
killedBy: Location Kafka Publishers Unit Suite publishTripCancelled should construct TripCancelled event with reason and call publishEvent with TRIP_CANCELLED topic
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/events/publishers/locationPublisher.ts:80:37
   cancelledBy: 'doctor' | 'patient' | 'system';
   reason?: string;
 }): Promise<void> {
-  const event: TripCancelledEvent = {
-    ...createBaseEvent(),
-    eventType: 'TripCancelled',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    cancelledBy: params.cancelledBy,
-    reason: params.reason,
-  };
+  const event: TripCancelledEvent = {};
 
   logger.info('[LocationPublisher] Publishing TripCancelled event', {
killedBy: Location Kafka Publishers Unit Suite publishTripCancelled should construct TripCancelled event with reason and call publishEvent with TRIP_CANCELLED topic
statusReason: expected "vi.fn()" to be called with arguments: [ 'docdock.trip.cancelled', …(1) ]

Received:

  1st vi.fn() call:

  [
    "docdock.trip.cancelled",

[Survived] ObjectLiteral
src/events/publishers/locationPublisher.ts:90:69
     reason: params.reason,
   };
 
-  logger.info('[LocationPublisher] Publishing TripCancelled event', {
-    eventType: 'TripCancelled',
-    eventId: event.eventId,
-    appointmentId: event.appointmentId,
-    userId: event.patientId,
-  });
+  logger.info('[LocationPublisher] Publishing TripCancelled event', {});
 
   await publishEvent(KAFKA_TOPICS.TRIP_CANCELLED, event);

[Killed] BlockStatement
src/events/publishers/locationPublisher.ts:104:19
   appointmentId: string;
   doctorId: string;
   patientId: string;
-}): Promise<void> {
-  const event: TripCompletedEvent = {
-    ...createBaseEvent(),
-    eventType: 'TripCompleted',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    completedAt: new Date().toISOString(),
-  };
-
-  logger.info('[LocationPublisher] Publishing TripCompleted event', {
-    eventType: 'TripCompleted',
-    eventId: event.eventId,
-    appointmentId: event.appointmentId,
-    userId: event.patientId,
-  });
-
-  await publishEvent(KAFKA_TOPICS.TRIP_COMPLETED, event);
-}
+}): Promise<void> {}
 
killedBy: Location Kafka Publishers Unit Suite publishTripCompleted should construct TripCompleted event and call publishEvent with TRIP_COMPLETED topic
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/events/publishers/locationPublisher.ts:105:37
   doctorId: string;
   patientId: string;
 }): Promise<void> {
-  const event: TripCompletedEvent = {
-    ...createBaseEvent(),
-    eventType: 'TripCompleted',
-    appointmentId: params.appointmentId,
-    doctorId: params.doctorId,
-    patientId: params.patientId,
-    completedAt: new Date().toISOString(),
-  };
+  const event: TripCompletedEvent = {};
 
   logger.info('[LocationPublisher] Publishing TripCompleted event', {
killedBy: Location Kafka Publishers Unit Suite publishTripCompleted should construct TripCompleted event and call publishEvent with TRIP_COMPLETED topic
statusReason: expected "vi.fn()" to be called with arguments: [ 'docdock.trip.completed', …(1) ]

Received:

  1st vi.fn() call:

  [
    "docdock.trip.completed",

[Killed] StringLiteral
src/events/publishers/locationPublisher.ts:107:16
 }): Promise<void> {
   const event: TripCompletedEvent = {
     ...createBaseEvent(),
-    eventType: 'TripCompleted',
+    eventType: "",
     appointmentId: params.appointmentId,
     doctorId: params.doctorId,
killedBy: Location Kafka Publishers Unit Suite publishTripCompleted should construct TripCompleted event and call publishEvent with TRIP_COMPLETED topic
statusReason: expected "vi.fn()" to be called with arguments: [ 'docdock.trip.completed', …(1) ]

Received:

  1st vi.fn() call:

  [
    "docdock.trip.completed",

[Survived] StringLiteral
src/events/publishers/locationPublisher.ts:115:16
   };
 
   logger.info('[LocationPublisher] Publishing TripCompleted event', {
-    eventType: 'TripCompleted',
+    eventType: "",
     eventId: event.eventId,
     appointmentId: event.appointmentId,
