[Killed] BooleanLiteral
src/modules/tracking/tracking.service.ts:23:9
    */
   async getTrackingSnapshot(appointmentId: string, userId: string): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
-    if (!appointment) {
+    if (appointment) {
       throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
     }
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw APPOINTMENT_NOT_FOUND (404) if appointment does not exist
statusReason: expected a thrown error to be Error: Appointment not found { …(3) }

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:23:23
    */
   async getTrackingSnapshot(appointmentId: string, userId: string): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
-    if (!appointment) {
-      throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
-    }
+    if (!appointment) {}
 
     const doctor = await DoctorModel.findById(appointment.doctorId);
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw APPOINTMENT_NOT_FOUND (404) if appointment does not exist
statusReason: expected a thrown error to be Error: Appointment not found { …(3) }

[Killed] StringLiteral
src/modules/tracking/tracking.service.ts:24:26
   async getTrackingSnapshot(appointmentId: string, userId: string): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
     if (!appointment) {
-      throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
+      throw new ApiError("", 404, 'APPOINTMENT_NOT_FOUND');
     }
 
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw APPOINTMENT_NOT_FOUND (404) if appointment does not exist
statusReason: expected a thrown error to be Error: Appointment not found { …(3) }

[Killed] StringLiteral
src/modules/tracking/tracking.service.ts:24:56
   async getTrackingSnapshot(appointmentId: string, userId: string): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
     if (!appointment) {
-      throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
+      throw new ApiError('Appointment not found', 404, "");
     }
 
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw APPOINTMENT_NOT_FOUND (404) if appointment does not exist
statusReason: expected a thrown error to be Error: Appointment not found { …(3) }

[Killed] OptionalChaining
src/modules/tracking/tracking.service.ts:28:26
     }
 
     const doctor = await DoctorModel.findById(appointment.doctorId);
-    const doctorUserId = doctor?.userId.toString();
+    const doctorUserId = doctor.userId.toString();
     const patientUserId = appointment.patientId.toString();
 
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should authorize doctor via direct doctorId match when doctor model lookup returns null
statusReason: Cannot read properties of null (reading 'userId')

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:31:37
     const doctorUserId = doctor?.userId.toString();
     const patientUserId = appointment.patientId.toString();
 
-    if (patientUserId !== userId && doctorUserId !== userId && appointment.doctorId.toString() !== userId) {
+    if (patientUserId !== userId && true && appointment.doctorId.toString() !== userId) {
       throw new ApiError('Forbidden: You are not authorized to view tracking for this appointment', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should return snapshot for doctor when status is arrived and fallback liveLocation to null if Redis empty
statusReason: Forbidden: You are not authorized to view tracking for this appointment

[Killed] LogicalOperator
src/modules/tracking/tracking.service.ts:31:9
     const doctorUserId = doctor?.userId.toString();
     const patientUserId = appointment.patientId.toString();
 
-    if (patientUserId !== userId && doctorUserId !== userId && appointment.doctorId.toString() !== userId) {
+    if (patientUserId !== userId || doctorUserId !== userId && appointment.doctorId.toString() !== userId) {
       throw new ApiError('Forbidden: You are not authorized to view tracking for this appointment', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw TRACKING_NOT_ACTIVE (400) if status is pending, accepted, or completed
statusReason: expected a thrown error to be Error: Tracking not active for this appoi… { …(3) }

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:35:9
       throw new ApiError('Forbidden: You are not authorized to view tracking for this appointment', 403, 'FORBIDDEN');
     }
 
-    if (!['doctor_on_way', 'arrived', 'in_consultation'].includes(appointment.status)) {
+    if (true) {
       throw new ApiError('Tracking not active for this appointment state', 400, 'TRACKING_NOT_ACTIVE');
     }
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should return snapshot for patient when status is doctor_on_way and return Redis live location if present
statusReason: Tracking not active for this appointment state

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:35:88
       throw new ApiError('Forbidden: You are not authorized to view tracking for this appointment', 403, 'FORBIDDEN');
     }
 
-    if (!['doctor_on_way', 'arrived', 'in_consultation'].includes(appointment.status)) {
-      throw new ApiError('Tracking not active for this appointment state', 400, 'TRACKING_NOT_ACTIVE');
-    }
+    if (!['doctor_on_way', 'arrived', 'in_consultation'].includes(appointment.status)) {}
 
     // Attempt to fetch high-frequency ephemeral location from Redis first
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should throw TRACKING_NOT_ACTIVE (400) if status is pending, accepted, or completed
statusReason: promise resolved "{ …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:46:21
     return {
       appointmentId,
       status: appointment.status,
-      liveLocation: liveLocation || null,
+      liveLocation: false,
       doctorCurrentLocation: session.doctorCurrentLocation,
       patientLocation: session.patientLocation,
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should return snapshot for patient when status is doctor_on_way and return Redis live location if present
statusReason: expected false to deeply equal { latitude: 23.0225, …(4) }

[Killed] LogicalOperator
src/modules/tracking/tracking.service.ts:46:21
     return {
       appointmentId,
       status: appointment.status,
-      liveLocation: liveLocation || null,
+      liveLocation: liveLocation && null,
       doctorCurrentLocation: session.doctorCurrentLocation,
       patientLocation: session.patientLocation,
killedBy: TrackingService Full Unit & Integration Suite getTrackingSnapshot should return snapshot for patient when status is doctor_on_way and return Redis live location if present
statusReason: expected null to deeply equal { latitude: 23.0225, …(4) }

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:58:9
    */
   async startTrip(appointmentId: string, userId: string, initialCoordinates?: [number, number]): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
-    if (!appointment) {
+    if (false) {
       throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
     }
killedBy: TrackingService Full Unit & Integration Suite startTrip should throw APPOINTMENT_NOT_FOUND (404) if appointment does not exist
statusReason: expected [Function] to throw error including 'Appointment not found' but got 'Forbidden: Only the assigned doctor c…'

[Survived] ObjectLiteral
src/modules/tracking/tracking.service.ts:62:46
       throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
     }
 
-    const doctor = await DoctorModel.findOne({ userId });
+    const doctor = await DoctorModel.findOne({});
     if (!doctor || appointment.doctorId.toString() !== doctor._id.toString()) {
       throw new ApiError('Forbidden: Only the assigned doctor can start the journey', 403, 'FORBIDDEN');

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:63:9
     }
 
     const doctor = await DoctorModel.findOne({ userId });
-    if (!doctor || appointment.doctorId.toString() !== doctor._id.toString()) {
+    if (true) {
       throw new ApiError('Forbidden: Only the assigned doctor can start the journey', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite startTrip should throw INVALID_TRANSITION (400) if starting trip from pending or completed state
statusReason: expected [Function] to throw error including 'Cannot start trip from appointment st…' but got 'Forbidden: Only the assigned doctor c…'

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:63:79
     }
 
     const doctor = await DoctorModel.findOne({ userId });
-    if (!doctor || appointment.doctorId.toString() !== doctor._id.toString()) {
-      throw new ApiError('Forbidden: Only the assigned doctor can start the journey', 403, 'FORBIDDEN');
-    }
+    if (!doctor || appointment.doctorId.toString() !== doctor._id.toString()) {}
 
     if (!['accepted', 'confirmed'].includes(appointment.status)) {
killedBy: TrackingService Full Unit & Integration Suite startTrip should throw FORBIDDEN (403) if user is not assigned doctor or doctor profile not found
statusReason: expected [Function] to throw error including 'Forbidden: Only the assigned doctor c…' but got 'appointment.save is not a function'

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:67:66
       throw new ApiError('Forbidden: Only the assigned doctor can start the journey', 403, 'FORBIDDEN');
     }
 
-    if (!['accepted', 'confirmed'].includes(appointment.status)) {
-      throw new ApiError(`Cannot start trip from appointment status '${appointment.status}'`, 400, 'INVALID_TRANSITION');
-    }
+    if (!['accepted', 'confirmed'].includes(appointment.status)) {}
 
     appointment.status = 'doctor_on_way';
killedBy: TrackingService Full Unit & Integration Suite startTrip should throw INVALID_TRANSITION (400) if starting trip from pending or completed state
statusReason: expected [Function] to throw error including 'Cannot start trip from appointment st…' but got 'appointment.save is not a function'

[Killed] BooleanLiteral
src/modules/tracking/tracking.service.ts:67:9
       throw new ApiError('Forbidden: Only the assigned doctor can start the journey', 403, 'FORBIDDEN');
     }
 
-    if (!['accepted', 'confirmed'].includes(appointment.status)) {
+    if (['accepted', 'confirmed'].includes(appointment.status)) {
       throw new ApiError(`Cannot start trip from appointment status '${appointment.status}'`, 400, 'INVALID_TRANSITION');
     }
killedBy: TrackingService Full Unit & Integration Suite startTrip should throw INVALID_TRANSITION (400) if starting trip from pending or completed state
statusReason: expected [Function] to throw error including 'Cannot start trip from appointment st…' but got 'appointment.save is not a function'

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:75:9
     await appointment.save();
 
     let locationPayload: EphemeralLocation | null = null;
-    if (initialCoordinates) {
+    if (false) {
       locationPayload = await this.repository.setEphemeralLocation(
         appointmentId,
killedBy: TrackingService Full Unit & Integration Suite startTrip should start trip from confirmed status, save appointment status doctor_on_way, and fire Kafka & Socket.IO
statusReason: expected "vi.fn()" to be called with arguments: [ '507f191e810c19729de86005', …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:75:29
     await appointment.save();
 
     let locationPayload: EphemeralLocation | null = null;
-    if (initialCoordinates) {
-      locationPayload = await this.repository.setEphemeralLocation(
-        appointmentId,
-        doctor._id.toString(),
-        initialCoordinates
-      );
-      await this.repository.updateLocation(appointmentId, initialCoordinates);
-    }
+    if (initialCoordinates) {}
 
     // Publish DoctorOnTheWay domain event to Kafka (non-blocking)
killedBy: TrackingService Full Unit & Integration Suite startTrip should start trip from confirmed status, save appointment status doctor_on_way, and fire Kafka & Socket.IO
statusReason: expected "vi.fn()" to be called with arguments: [ '507f191e810c19729de86005', …(2) ]

Number of calls: 0

[Survived] BlockStatement
src/modules/tracking/tracking.service.ts:89:23
       appointmentId: appointment._id.toString(),
       doctorId: doctor._id.toString(),
       patientId: appointment.patientId.toString(),
-    }).catch((err) => {
-      logger.warn('[TrackingService] Failed to publish DoctorOnTheWay Kafka event', {
-        error: err instanceof Error ? err.message : String(err),
-        appointmentId,
-      });
-    });
+    }).catch((err) => {});
 
     // Notify connected patient socket room

[Survived] StringLiteral
src/modules/tracking/tracking.service.ts:90:19
       doctorId: doctor._id.toString(),
       patientId: appointment.patientId.toString(),
     }).catch((err) => {
-      logger.warn('[TrackingService] Failed to publish DoctorOnTheWay Kafka event', {
+      logger.warn("", {
         error: err instanceof Error ? err.message : String(err),
         appointmentId,

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:97:9
     });
 
     // Notify connected patient socket room
-    try {
-      const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:trip:started', {
-        appointmentId,
-        doctorId: doctor._id.toString(),
-        timestamp: Date.now(),
-        initialLocation: locationPayload,
-      });
-    } catch (err) {
+    try {} catch (err) {
       logger.warn('[TrackingService] Socket notification error on trip start', { error: String(err) });
     }
killedBy: TrackingService Full Unit & Integration Suite startTrip should start trip from confirmed status, save appointment status doctor_on_way, and fire Kafka & Socket.IO
statusReason: expected "vi.fn()" to be called with arguments: [ '/tracking' ]

Number of calls: 0

[Survived] BlockStatement
src/modules/tracking/tracking.service.ts:105:19
         timestamp: Date.now(),
         initialLocation: locationPayload,
       });
-    } catch (err) {
-      logger.warn('[TrackingService] Socket notification error on trip start', { error: String(err) });
-    }
+    } catch (err) {}
 
     return {

[Killed] ObjectLiteral
src/modules/tracking/tracking.service.ts:109:12
       logger.warn('[TrackingService] Socket notification error on trip start', { error: String(err) });
     }
 
-    return {
-      appointmentId,
-      status: 'doctor_on_way',
-      liveLocation: locationPayload,
-    };
+    return {};
   }
 
killedBy: TrackingService Full Unit & Integration Suite startTrip should start trip from confirmed status, save appointment status doctor_on_way, and fire Kafka & Socket.IO
statusReason: expected undefined to be 'doctor_on_way' // Object.is equality

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:122:9
    */
   async updateDoctorLocation(appointmentId: string, userId: string, coordinates: [number, number]): Promise<unknown> {
     const appointment = await AppointmentModel.findById(appointmentId);
-    if (!appointment) {
+    if (true) {
       throw new ApiError('Appointment not found', 404, 'APPOINTMENT_NOT_FOUND');
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw FORBIDDEN (403) if user is not assigned doctor
statusReason: expected [Function] to throw error including 'Forbidden: Only the assigned doctor c…' but got 'Appointment not found'

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:127:30
     }
 
     const doctor = await DoctorModel.findOne({ userId });
-    const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
+    const isAssignedDoctor = false;
     const isDirectDoctorId = appointment.doctorId.toString() === userId;
 
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw TRACKING_NOT_ACTIVE (400) if status is not doctor_on_way
statusReason: expected [Function] to throw error including 'Location sharing is inactive. Current…' but got 'Forbidden: Only the assigned doctor c…'

[Killed] LogicalOperator
src/modules/tracking/tracking.service.ts:127:30
     }
 
     const doctor = await DoctorModel.findOne({ userId });
-    const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
+    const isAssignedDoctor = doctor || appointment.doctorId.toString() === doctor._id.toString();
     const isDirectDoctorId = appointment.doctorId.toString() === userId;
 
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw FORBIDDEN (403) if user is not assigned doctor
statusReason: expected [Function] to throw error including 'Forbidden: Only the assigned doctor c…' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:128:30
 
     const doctor = await DoctorModel.findOne({ userId });
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
-    const isDirectDoctorId = appointment.doctorId.toString() === userId;
+    const isDirectDoctorId = true;
 
     if (!isAssignedDoctor && !isDirectDoctorId) {
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw FORBIDDEN (403) if user is not assigned doctor
statusReason: promise resolved "{ …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:128:30
 
     const doctor = await DoctorModel.findOne({ userId });
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
-    const isDirectDoctorId = appointment.doctorId.toString() === userId;
+    const isDirectDoctorId = false;
 
     if (!isAssignedDoctor && !isDirectDoctorId) {
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should update location via direct doctorId match when doctor findOne is null
statusReason: Forbidden: Only the assigned doctor can update trip location

[Killed] BooleanLiteral
src/modules/tracking/tracking.service.ts:130:30
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
     const isDirectDoctorId = appointment.doctorId.toString() === userId;
 
-    if (!isAssignedDoctor && !isDirectDoctorId) {
+    if (!isAssignedDoctor && isDirectDoctorId) {
       throw new ApiError('Forbidden: Only the assigned doctor can update trip location', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw FORBIDDEN (403) if user is not assigned doctor
statusReason: promise resolved "{ …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:130:9
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
     const isDirectDoctorId = appointment.doctorId.toString() === userId;
 
-    if (!isAssignedDoctor && !isDirectDoctorId) {
+    if (false) {
       throw new ApiError('Forbidden: Only the assigned doctor can update trip location', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw FORBIDDEN (403) if user is not assigned doctor
statusReason: promise resolved "{ …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:134:9
       throw new ApiError('Forbidden: Only the assigned doctor can update trip location', 403, 'FORBIDDEN');
     }
 
-    if (appointment.status !== 'doctor_on_way') {
+    if (true) {
       throw new ApiError(`Location sharing is inactive. Current status: '${appointment.status}'`, 400, 'TRACKING_NOT_ACTIVE');
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should update location via direct doctorId match when doctor findOne is null
statusReason: Location sharing is inactive. Current status: 'doctor_on_way'

[Killed] EqualityOperator
src/modules/tracking/tracking.service.ts:134:9
       throw new ApiError('Forbidden: Only the assigned doctor can update trip location', 403, 'FORBIDDEN');
     }
 
-    if (appointment.status !== 'doctor_on_way') {
+    if (appointment.status === 'doctor_on_way') {
       throw new ApiError(`Location sharing is inactive. Current status: '${appointment.status}'`, 400, 'TRACKING_NOT_ACTIVE');
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should throw TRACKING_NOT_ACTIVE (400) if status is not doctor_on_way
statusReason: promise resolved "{ …(4) }" instead of rejecting

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:150:9
     );
 
     // 2. Broadcast live coordinates via Socket.IO to room `appointment:{id}`
-    try {
-      const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:update', {
-        appointmentId,
-        latitude: coordinates[1],
-        longitude: coordinates[0],
-        timestamp,
-      });
-    } catch (err) {
+    try {} catch (err) {
       logger.warn('[TrackingService] Socket emit doctor:location:update failed', { error: String(err) });
     }
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should emit doctor:location:update via Socket.IO to room appointment:{id}
statusReason: expected "vi.fn()" to be called with arguments: [ '/tracking' ]

Number of calls: 0

[Killed] StringLiteral
src/modules/tracking/tracking.service.ts:152:66
     // 2. Broadcast live coordinates via Socket.IO to room `appointment:{id}`
     try {
       const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:update', {
+      io.of('/tracking').to(`appointment:${appointmentId}`).emit("", {
         appointmentId,
         latitude: coordinates[1],
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should emit doctor:location:update via Socket.IO to room appointment:{id}
statusReason: expected "vi.fn()" to be called with arguments: [ 'doctor:location:update', { …(4) } ]

Received:

  1st vi.fn() call:

  [
-   "doctor:location:update",

[Killed] ObjectLiteral
src/modules/tracking/tracking.service.ts:152:92
     // 2. Broadcast live coordinates via Socket.IO to room `appointment:{id}`
     try {
       const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:update', {
-        appointmentId,
-        latitude: coordinates[1],
-        longitude: coordinates[0],
-        timestamp,
-      });
+      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:update', {});
     } catch (err) {
       logger.warn('[TrackingService] Socket emit doctor:location:update failed', { error: String(err) });
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should emit doctor:location:update via Socket.IO to room appointment:{id}
statusReason: expected "vi.fn()" to be called with arguments: [ 'doctor:location:update', { …(4) } ]

Received:

  1st vi.fn() call:

  [
    "doctor:location:update",

[Survived] BlockStatement
src/modules/tracking/tracking.service.ts:158:19
         longitude: coordinates[0],
         timestamp,
       });
-    } catch (err) {
-      logger.warn('[TrackingService] Socket emit doctor:location:update failed', { error: String(err) });
-    }
+    } catch (err) {}
 
     return {

[Killed] ObjectLiteral
src/modules/tracking/tracking.service.ts:162:12
       logger.warn('[TrackingService] Socket emit doctor:location:update failed', { error: String(err) });
     }
 
-    return {
-      appointmentId,
-      latitude: ephemeral.latitude,
-      longitude: ephemeral.longitude,
-      timestamp: ephemeral.timestamp,
-    };
+    return {};
   }
 
killedBy: TrackingService Full Unit & Integration Suite updateDoctorLocation should update location via direct doctorId match when doctor findOne is null
statusReason: expected undefined to be 23.0225 // Object.is equality

[Killed] EqualityOperator
src/modules/tracking/tracking.service.ts:180:40
     }
 
     const doctor = await DoctorModel.findOne({ userId });
-    const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
+    const isAssignedDoctor = doctor && appointment.doctorId.toString() !== doctor._id.toString();
 
     if (!isAssignedDoctor && appointment.patientId.toString() !== userId) {
killedBy: TrackingService Full Unit & Integration Suite endTrip should default reason to trip_ended when reason parameter is omitted
statusReason: Forbidden: You are not authorized to end this trip

[Killed] LogicalOperator
src/modules/tracking/tracking.service.ts:182:9
     const doctor = await DoctorModel.findOne({ userId });
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
 
-    if (!isAssignedDoctor && appointment.patientId.toString() !== userId) {
+    if (!isAssignedDoctor || appointment.patientId.toString() !== userId) {
       throw new ApiError('Forbidden: You are not authorized to end this trip', 403, 'FORBIDDEN');
     }
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: Forbidden: You are not authorized to end this trip

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:182:75
     const doctor = await DoctorModel.findOne({ userId });
     const isAssignedDoctor = doctor && appointment.doctorId.toString() === doctor._id.toString();
 
-    if (!isAssignedDoctor && appointment.patientId.toString() !== userId) {
-      throw new ApiError('Forbidden: You are not authorized to end this trip', 403, 'FORBIDDEN');
-    }
+    if (!isAssignedDoctor && appointment.patientId.toString() !== userId) {}
 
     // 1. Clear ephemeral location from Redis
killedBy: TrackingService Full Unit & Integration Suite endTrip should throw FORBIDDEN (403) if user is neither assigned doctor nor patient
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] BlockStatement
src/modules/tracking/tracking.service.ts:190:9
     await this.repository.clearEphemeralLocation(appointmentId);
 
     // 2. Notify Socket.IO room that live tracking has ended
-    try {
-      const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
-        appointmentId,
-        reason: reason || 'trip_ended',
-        timestamp: Date.now(),
-      });
-    } catch (err) {
+    try {} catch (err) {
       logger.warn('[TrackingService] Socket emit doctor:location:ended failed', { error: String(err) });
     }
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected "vi.fn()" to be called with arguments: [ '/tracking' ]

Number of calls: 0

[Killed] StringLiteral
src/modules/tracking/tracking.service.ts:192:13
     // 2. Notify Socket.IO room that live tracking has ended
     try {
       const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
+      io.of("").to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
         appointmentId,
         reason: reason || 'trip_ended',
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected "vi.fn()" to be called with arguments: [ '/tracking' ]

Received:

  1st vi.fn() call:

  [
-   "/tracking",

[Killed] StringLiteral
src/modules/tracking/tracking.service.ts:192:29
     // 2. Notify Socket.IO room that live tracking has ended
     try {
       const io = getIO();
-      io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
+      io.of('/tracking').to(``).emit('doctor:location:ended', {
         appointmentId,
         reason: reason || 'trip_ended',
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "appointment:507f191e810c19729de86005",

[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:194:17
       const io = getIO();
       io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
         appointmentId,
-        reason: reason || 'trip_ended',
+        reason: false,
         timestamp: Date.now(),
       });
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected "vi.fn()" to be called with arguments: [ 'doctor:location:ended', { …(3) } ]

Received:

  1st vi.fn() call:

  [
    "doctor:location:ended",
