[Killed] ConditionalExpression
src/modules/tracking/tracking.service.ts:194:17
       const io = getIO();
       io.of('/tracking').to(`appointment:${appointmentId}`).emit('doctor:location:ended', {
         appointmentId,
-        reason: reason || 'trip_ended',
+        reason: true,
         timestamp: Date.now(),
       });
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected "vi.fn()" to be called with arguments: [ 'doctor:location:ended', { …(3) } ]

Received:

  1st vi.fn() call:

  [
    "doctor:location:ended",

[Survived] BlockStatement
src/modules/tracking/tracking.service.ts:197:19
         reason: reason || 'trip_ended',
         timestamp: Date.now(),
       });
-    } catch (err) {
-      logger.warn('[TrackingService] Socket emit doctor:location:ended failed', { error: String(err) });
-    }
+    } catch (err) {}
 
     return { appointmentId, status: appointment.status, trackingActive: false };

[Survived] StringLiteral
src/modules/tracking/tracking.service.ts:198:19
         timestamp: Date.now(),
       });
     } catch (err) {
-      logger.warn('[TrackingService] Socket emit doctor:location:ended failed', { error: String(err) });
+      logger.warn("", { error: String(err) });
     }
 

[Killed] BooleanLiteral
src/modules/tracking/tracking.service.ts:201:73
       logger.warn('[TrackingService] Socket emit doctor:location:ended failed', { error: String(err) });
     }
 
-    return { appointmentId, status: appointment.status, trackingActive: false };
+    return { appointmentId, status: appointment.status, trackingActive: true };
   }
 }
killedBy: TrackingService Full Unit & Integration Suite endTrip should allow assigned patient to end trip, clear Redis location and emit doctor:location:ended
statusReason: expected true to be false // Object.is equality
