[Killed] MethodExpression
src/modules/tracking/tracking.validation.ts:4:37
 import { z } from 'zod';
 
 export const trackingParamsSchema = z.object({
-  params: z.object({ appointmentId: z.string().min(24) })
+  params: z.object({ appointmentId: z.string().max(24) })
 });
 
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) trackingParamsSchema should reject appointmentId shorter than 24 characters
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/modules/tracking/tracking.validation.ts:7:46
   params: z.object({ appointmentId: z.string().min(24) })
 });
 
-export const updateLocationSchema = z.object({
-  params: z.object({ appointmentId: z.string().min(24) }),
-  body: z.object({
-    // GeoJSON point format [longitude, latitude] or explicit object
-    coordinates: z
-      .tuple([
-        z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
-        z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
-      ]),
-    timestamp: z.number().optional().refine((val) => {
-      if (!val) return true;
-      const now = Date.now();
-      // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
-      return val > now - 120000 && val < now + 30000;
-    }, { message: 'Timestamp is stale or invalid' }),
-  })
-});
+export const updateLocationSchema = z.object({});
 
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should reject longitude less than -180
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/modules/tracking/tracking.validation.ts:8:37
 });
 
 export const updateLocationSchema = z.object({
-  params: z.object({ appointmentId: z.string().min(24) }),
+  params: z.object({ appointmentId: z.string().max(24) }),
   body: z.object({
     // GeoJSON point format [longitude, latitude] or explicit object

[Killed] UnaryOperator
src/modules/tracking/tracking.validation.ts:13:67
     // GeoJSON point format [longitude, latitude] or explicit object
     coordinates: z
       .tuple([
-        z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
+        z.number({ required_error: 'Longitude is required' }).min(+180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
         z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/modules/tracking/tracking.validation.ts:13:9
     // GeoJSON point format [longitude, latitude] or explicit object
     coordinates: z
       .tuple([
-        z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
+        z.number({
+  required_error: 'Longitude is required'
+}).max(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
         z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
src/modules/tracking/tracking.validation.ts:14:66
     coordinates: z
       .tuple([
         z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
-        z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
+        z.number({ required_error: 'Latitude is required' }).min(+90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
     timestamp: z.number().optional().refine((val) => {
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/modules/tracking/tracking.validation.ts:14:9
     coordinates: z
       .tuple([
         z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
-        z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
+        z.number({
+  required_error: 'Latitude is required'
+}).min(-90, 'Latitude must be >= -90').min(90, 'Latitude must be <= 90'),
       ]),
     timestamp: z.number().optional().refine((val) => {
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/tracking/tracking.validation.ts:16:54
         z.number({ required_error: 'Longitude is required' }).min(-180, 'Longitude must be >= -180').max(180, 'Longitude must be <= 180'),
         z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
-    timestamp: z.number().optional().refine((val) => {
-      if (!val) return true;
-      const now = Date.now();
-      // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
-      return val > now - 120000 && val < now + 30000;
-    }, { message: 'Timestamp is stale or invalid' }),
+    timestamp: z.number().optional().refine((val) => {}, { message: 'Timestamp is stale or invalid' }),
   })
 });
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/tracking/tracking.validation.ts:17:24
         z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
     timestamp: z.number().optional().refine((val) => {
-      if (!val) return true;
+      if (!val) return false;
       const now = Date.now();
       // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/tracking/tracking.validation.ts:17:11
         z.number({ required_error: 'Latitude is required' }).min(-90, 'Latitude must be >= -90').max(90, 'Latitude must be <= 90'),
       ]),
     timestamp: z.number().optional().refine((val) => {
-      if (!val) return true;
+      if (val) return true;
       const now = Date.now();
       // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Latitude & Longitude Bounds should accept exact boundary coordinates [-180, -90] and [180, 90]
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/tracking/tracking.validation.ts:20:36
       if (!val) return true;
       const now = Date.now();
       // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
-      return val > now - 120000 && val < now + 30000;
+      return val > now - 120000 && val >= now + 30000;
     }, { message: 'Timestamp is stale or invalid' }),
   })
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Timestamp Freshness should accept current timestamp
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/tracking/tracking.validation.ts:20:36
       if (!val) return true;
       const now = Date.now();
       // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
-      return val > now - 120000 && val < now + 30000;
+      return val > now - 120000 && true;
     }, { message: 'Timestamp is stale or invalid' }),
   })
killedBy: Tracking Validation Schema (updateLocationSchema & trackingParamsSchema) updateLocationSchema — Timestamp Freshness should reject future timestamp (> 30 seconds in future)
statusReason: expected true to be false // Object.is equality

[Survived] ObjectLiteral
src/modules/tracking/tracking.validation.ts:21:8
       const now = Date.now();
       // Timestamp must not be more than 120 seconds old, nor more than 30 seconds in the future
       return val > now - 120000 && val < now + 30000;
-    }, { message: 'Timestamp is stale or invalid' }),
+    }, {}),
   })
 });
